app/controllers/book_controller.rb

INSERT INTO "books" ("name", "created_at", "updated_at") VALUES('Aesop''s Fables', '2010-02-13 00:31:44', '2010-02-13 00:31:44')
INSERT INTO "book_lines" ("created_at", "line", "updated_at", "linenum", "source") VALUES('2010-02-13 00:31:44', '**This is the SECOND Project Gutenberg Etext of Aesop''s Fables**', '2010-02-13 00:31:44', 0, 6)
---
	def create
      book = Book.new(:name=>params[:book][:name])
#	  puts "\n\n\n"
#	  puts "params[:book][:name] = "
#      puts params[:book][:content]
#	  puts "\n\n\n"
	  book.save
	  content = params[:book][:content].split("\n")
      num = 0
      for line in content
        a = BookLine.new(:line=>line,:linenum=>num)
        a.source = book
        a.save