app/controllers/search_controller.rb

SELECT * FROM "book_lines" WHERE (linenum = 2877 and source = 4) LIMIT 1
SELECT * FROM "books" WHERE ("books"."id" = 4)
---
	def context
		@query = params[:word]
		@contexts = Array.new()
		la = BookLine.find(:all, :conditions => ["line like ?", "%" + @query + "%"])

		for line in la do
			beforeline = BookLine.find(:first, :conditions => ["linenum = ? and source = ?", line.linenum - 1, line.source])
			afterline = BookLine.find(:first, :conditions => ["linenum = ? and source = ?", line.linenum + 1, line.source])
			if (beforeline != nil) then beforeline = beforeline.line end
			if (afterline != nil) then afterline = afterline.line end
			bookname = Book.find(line.source).name